/*1) Создайте массив arr = ['a', 'b', 'c', 'd'] и с его помощью выведите
на экран строку 'a+b, c+d'.*/

let  arr = ['a', 'b', 'c', 'd'];
alert(arr[0] + '+' + arr[1] + ' ' + arr[2] + '+' + arr[3]);
console.log(arr[0] + '+' + arr[1] + ' ' + arr[2] + '+' + arr[3]);

/*2) Создайте массив с элементами 10, 15, 9, 10.
- Умножьте первый элемент массива на второй,
    - а третий элемент на четвертый.
    Результаты сложите, присвойте переменной result.
    Выведите на экран значение этой переменной.*/
let one = [10, 15, 9, 10];
let result = ((one[0] * one[1]) + (one[2] * one[3]));
alert(result);
console.log(result);

/*3) Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3.*/
let two = ['a', 'b', 'c'];
two.push(1,2,3);
console.log(two);

/*4) Создайте массив с различными числами. Должно быть как минимум 10 элементов
внутри массива. С помощью цикла пройдитесь по каждому из них и у умножьте на 2.*/
let count = [1,2,3,4,5,6,7,8,9,10];
for(let i = 0; i <= 9; i++){
    console.log(count[i]*2)
}

// 5 classroom work
let users = ['Maks','Dima','Sasha'];
for(let a = 0; a < 3; a++){
    console.log(users[a]);
}
